Masmiseim36/nxpSDK/boards/frdmkv11z/demo_apps/mc_pmsm/pmsm_snsless_reg_init/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Enable alternative conversion triggers for ADC0.: PDB0 CH0 triggers ADC0 */
#define SOPT7_ADC0ALTTRGEN_PDB0 0x00u
/*!
 * @brief Enable alternative conversion triggers for ADC1.: PDB0 CH1 triggers ADC1 */
#define SOPT7_ADC1ALTTRGEN_PDB0 0x00u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_ADC(void);

/*!
 * @brief FTM0 Fault 1 Select: CMP1 out */
#define SOPT4_FTM0FLT1_CMP 0x01u
/*!
 * @brief FTM0 channel 0 output PWM/OCMP mode source select: FTM0CH0 pin is the output of FTM0 channel 0 PWM/OCMP */
#define SOPT8_FTM0OCH0SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 1 output PWM/OCMP mode source select: FTM0CH1 pin is the output of FTM0 channel 1 PWM/OCMP */
#define SOPT8_FTM0OCH1SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 2 output PWM/OCMP mode source select: FTM0CH2 pin is the output of FTM0 channel 2 PWM/OCMP */
#define SOPT8_FTM0OCH2SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 3 output PWM/OCMP mode source select: FTM0CH3 pin is the output of FTM0 channel 3 PWM/OCMP */
#define SOPT8_FTM0OCH3SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 4 output PWM/OCMP mode source select: FTM0CH4 pin is the output of FTM0 channel 4 PWM/OCMP */
#define SOPT8_FTM0OCH4SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 5 output PWM/OCMP mode source select: FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP */
#define SOPT8_FTM0OCH5SRC_NO_MODULATION 0x00u

/*! @name PORTC1 (number 44), J18[14]/J22[A40]/J500[9]/U2[3]/FTM0_CH0/LED0
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_LED_GREEN1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_LED_GREEN1_PIN 1U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_LED_GREEN1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC2 (number 45), J18[15]/J22[A39]/J24[15]/J500[11]/U2[4]/FTM0_CH1/LED1
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_LED_YELLOW1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_LED_YELLOW1_PIN 2U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_LED_YELLOW1_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC3 (number 46), J1[1]/J18[16]/J22[A38]/J24[16]/J500[30]/U2[5]/FTM0_CH2/LED2
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_LED_GREEN2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_LED_GREEN2_PIN 3U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_LED_GREEN2_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC4 (number 49), J22[A37]/J24[17]/J500[32]/U2[6]/FTM0_CH3/LED3
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_LED_YELLOW2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_LED_YELLOW2_PIN 4U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_LED_YELLOW2_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD4 (number 61), J22[B40]/J24[25]/J500[34]/U2[7]/FTM0_CH4/LED4
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_LED_GREEN3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_LED_GREEN3_PIN 4U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_LED_GREEN3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTD5 (number 62), J22[B39]/J24[26]/J500[36]/U2[8]/FTM0_CH5/LED5
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_LED_YELLOW3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_LED_YELLOW3_PIN 5U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_LED_YELLOW3_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_FTM(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 Receive Data Source Select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 Transmit Data Source Select: UART0_TX pin */

/*! @name PORTB16 (number 39), J24[9]/J500[7]/J506[2]/U512[2]/RXD0
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_UART_DEBUG_UART_RX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define PINTOOL_UART_DEBUG_UART_RX_PIN 16U                   /*!<@brief PORT pin number */
#define PINTOOL_UART_DEBUG_UART_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTB17 (number 40), J24[10]/J500[5]/J505[2]/U513[4]/TXD0
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_UART_DEBUG_UART_TX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define PINTOOL_UART_DEBUG_UART_TX_PIN 17U                   /*!<@brief PORT pin number */
#define PINTOOL_UART_DEBUG_UART_TX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

/*! @name PORTD6 (number 63), J22[B33]/J22[D34]/J24[27]/J500[13]/U2[9]/FTM1_CH0/LED6
  @{ */

/* Symbols to be used with GPIO driver */
#define PINTOOL_GPIO_LED2_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define PINTOOL_GPIO_LED2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define PINTOOL_GPIO_LED2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PINTOOL_GPIO_LED2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_GPIO_LED2_PIN 6U                   /*!<@brief PORT pin number */
#define PINTOOL_GPIO_LED2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTE29 (number 17), J18[12]/J22[B52]/J22[D52]/CMP0_IN5
  @{ */

/* Symbols to be used with GPIO driver */
#define PINTOOL_GPIO_LED1_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define PINTOOL_GPIO_LED1_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define PINTOOL_GPIO_LED1_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PINTOOL_GPIO_LED1_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define PINTOOL_GPIO_LED1_PIN 29U                   /*!<@brief PORT pin number */
#define PINTOOL_GPIO_LED1_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTB0 (number 35), J18[17]/J22[C30]/J500[38]/ADC0_SE8
  @{ */

/* Symbols to be used with GPIO driver */
#define PINTOOL_GPIO_SW2_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define PINTOOL_GPIO_SW2_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define PINTOOL_GPIO_SW2_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PINTOOL_GPIO_SW2_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_GPIO_SW2_PIN 0U                   /*!<@brief PORT pin number */
#define PINTOOL_GPIO_SW2_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_GPIO(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
